install/v4/ZWSSMART4.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="ServiceTimbra4" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://tempuri.org/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/ZWSSMART4"/><xs:element name="GetData"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="value" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetDataResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataUsingDataContract"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="composite" nillable="true" type="q1:CompositeType" xmlns:q1="http://schemas.datacontract.org/2004/07/ZWSSMART4"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataUsingDataContractResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetDataUsingDataContractResult" nillable="true" type="q2:CompositeType" xmlns:q2="http://schemas.datacontract.org/2004/07/ZWSSMART4"/></xs:sequence></xs:complexType></xs:element><xs:element name="WsSmart"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="_user" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="_password" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="_syst" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="_option" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="xml_in" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="uuid" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="rfc" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="passKey" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="name_key" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="name_cer" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="motivo" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="folioSustitucion" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="WsSmartResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="WsSmartResult" nillable="true" type="q3:RESULT" xmlns:q3="http://schemas.datacontract.org/2004/07/ZWSSMART4"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/ZWSSMART4" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/ZWSSMART4"><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:complexType name="CompositeType"><xs:sequence><xs:element minOccurs="0" name="BoolValue" type="xs:boolean"/><xs:element minOccurs="0" name="StringValue" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="CompositeType" nillable="true" type="tns:CompositeType"/><xs:complexType name="RESULT"><xs:sequence><xs:element minOccurs="0" name="List_res" nillable="true" type="q1:ArrayOfstring" xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:element minOccurs="0" name="Xml" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="RESULT" nillable="true" type="tns:RESULT"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><xs:complexType name="ArrayOfstring"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="string" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="ArrayOfstring" nillable="true" type="tns:ArrayOfstring"/></xs:schema></wsdl:types><wsdl:message name="IServiceTimbra4_GetData_InputMessage"><wsdl:part name="parameters" element="tns:GetData"/></wsdl:message><wsdl:message name="IServiceTimbra4_GetData_OutputMessage"><wsdl:part name="parameters" element="tns:GetDataResponse"/></wsdl:message><wsdl:message name="IServiceTimbra4_GetDataUsingDataContract_InputMessage"><wsdl:part name="parameters" element="tns:GetDataUsingDataContract"/></wsdl:message><wsdl:message name="IServiceTimbra4_GetDataUsingDataContract_OutputMessage"><wsdl:part name="parameters" element="tns:GetDataUsingDataContractResponse"/></wsdl:message><wsdl:message name="IServiceTimbra4_WsSmart_InputMessage"><wsdl:part name="parameters" element="tns:WsSmart"/></wsdl:message><wsdl:message name="IServiceTimbra4_WsSmart_OutputMessage"><wsdl:part name="parameters" element="tns:WsSmartResponse"/></wsdl:message><wsdl:portType name="IServiceTimbra4"><wsdl:operation name="GetData"><wsdl:input wsaw:Action="http://tempuri.org/IServiceTimbra4/GetData" message="tns:IServiceTimbra4_GetData_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IServiceTimbra4/GetDataResponse" message="tns:IServiceTimbra4_GetData_OutputMessage"/></wsdl:operation><wsdl:operation name="GetDataUsingDataContract"><wsdl:input wsaw:Action="http://tempuri.org/IServiceTimbra4/GetDataUsingDataContract" message="tns:IServiceTimbra4_GetDataUsingDataContract_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IServiceTimbra4/GetDataUsingDataContractResponse" message="tns:IServiceTimbra4_GetDataUsingDataContract_OutputMessage"/></wsdl:operation><wsdl:operation name="WsSmart"><wsdl:input wsaw:Action="http://tempuri.org/IServiceTimbra4/WsSmart" message="tns:IServiceTimbra4_WsSmart_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IServiceTimbra4/WsSmartResponse" message="tns:IServiceTimbra4_WsSmart_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IServiceTimbra4" type="tns:IServiceTimbra4"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetData"><soap:operation soapAction="http://tempuri.org/IServiceTimbra4/GetData" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetDataUsingDataContract"><soap:operation soapAction="http://tempuri.org/IServiceTimbra4/GetDataUsingDataContract" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="WsSmart"><soap:operation soapAction="http://tempuri.org/IServiceTimbra4/WsSmart" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="ServiceTimbra4"><wsdl:port name="BasicHttpBinding_IServiceTimbra4" binding="tns:BasicHttpBinding_IServiceTimbra4"><soap:address location="http://desktop-8e05ubg:8081/ZWSSMART4.svc"/></wsdl:port></wsdl:service></wsdl:definitions>